### Aim: To create a connection and retrieve data between MSSQL and Pyton

To read and save data in a table structure: pandas

To connect to SQLServer database: pyodbc

To ignore warnings: warnings

In [13]:
import pyodbc
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

Define variables holding database credentials and details

In [2]:
driver = "{SQL Server}"
server = "FAY"
database = "AdventureWorks2019;"

Use the Connect function from pyodbc to establish a database connection.In the connect function we concatenate the variable to create a connection string

In [8]:
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=FAY;'
                      'Database=AdventureWorks2019;'
                      'Trusted_Connection=yes;')

SQL query to test our connection to the above SQL Server database.

In [9]:
sql = "SELECT * FROM HumanResources.Employee"

 Use the pandas read SQL query function to query the database.This takes the SQL Query and the database connection that is saved in the variable.

In [14]:
data = pd.read_sql_query(sql, conn)
data.head()

,BusinessEntityID,NationalIDNumber,LoginID,OrganizationNode,OrganizationLevel,JobTitle,BirthDate,MaritalStatus,Gender,HireDate,SalariedFlag,VacationHours,SickLeaveHours,CurrentFlag,rowguid,ModifiedDate
0,1,295847284,adventure-works\ken0,None,NaN,Chief Executive Officer,1969-01-29,S,M,2009-01-14,True,99,69,True,F01251E5-96A3-448D-981E-0F99D789110D,2014-06-30
1,2,245797967,adventure-works\terri0,b'X',1.0,Vice President of Engineering,1971-08-01,S,F,2008-01-31,True,1,20,True,45E8F437-670D-4409-93CB-F9424A40D6EE,2014-06-30
2,3,509647174,adventure-works\roberto0,b'Z\xc0',2.0,Engineering Manager,1974-11-12,M,M,2007-11-11,True,2,21,True,9BBBFB2C-EFBB-4217-9AB7-F97689328841,2014-06-30
3,4,112457891,adventure-works\rob0,b'Z\xd6',3.0,Senior Tool Designer,1974-12-23,S,M,2007-12-05,False,48,80,True,59747955-87B8-443F-8ED4-F8AD3AFDF3A9,2014-06-30
4,5,695256908,adventure-works\gail0,b'Z\xda',3.0,Design Engineer,1952-09-27,M,F,2008-01-06,True,5,22,True,EC84AE09-F9B8-4A15-B4A9-6CCBAB919B08,2014-06-30